{"url": "http://366weirdmovies.com/amicus-anthologies-part-one-1965-1972/", "digest": "sha1:JHVTURYTWEXBZZLRMBSZEEZRTAE7HVBG", "length": 10040, "nlines": 28, "source_domain": "366weirdmovies.com", "title": "AMICUS ANTHOLOGIES, PART ONE (1965-1972) | 366 Weird Movies", "raw_content": "AMICUS ANTHOLOGIES, PART ONE (1965-1972)\nFebruary 23, 2017 Alfred Eaker Leave a comment\nWith Dr. Terror’s House of Horrors (1965, directed by Freddie Francis and written by Milton Subotsky) Amicus Productions (spearheaded by Subotsky and Max Rosenberg, who previously produced for Hammer and was a cousin to Doris Wishman) established itself as a vital competitor to Hammer Studios. Rather than imitating Hammer’s modernization of Gothic classics, Amicus developed its own niche with omnibus films. They were successful enough to be in full-fledged production for a decade, establishing a reputation as the go-to studio for horror anthologies. This, their introductory portmanteau film, clearly influenced by EC Comics, sets a pattern of to-be-expected unevenness. Still, Amicus installs themselves as a horror studio to be reckoned with, sparing no expense in procuring Hammer’s top actors: Peter Cushing (who would star in all but one of the Amicus anthologies) and Christopher Lee. For its wraparound segment, Dr. Terror’s House of Horrors opens to the duo (among other passengers) on a train. Dr. Schreck ((“Shreck” is German for “terror,” and a nod to the famous star of F.W. Murnau‘s Nosferatu.)) (Cushing, saddled with a terrible German accent and glued on brows) pulls out a deck of tarot cards. “Pick a card, any card, and tape it three times,” Schreck tells his fellow passengers. Each participant will hear of a fate that may await them. Among the passengers is Christopher Lee who will, of course, factor into one of the five narratives.\nIn “Werewolf,” Neil McCallum is an architect renovating an old dark house, which turns out to be cursed. The title monster is featured in this pedestrian tale of ancestral revenge with a “twist.”\nWith Alan Freeman (better known as the U.K D.J. for “Pick of the Pops”) served up as a snack for a venus fly trap, “The Creeping Vine,” thankfully doesn’t take itself so seriously. It is refreshingly lightheaded hokum.\n“Voodoo” is the worst of the lot; badly dated in its stereotypes, with Kenny Lynch belting out a stolen voodoo tune.\n“Disembodied Hand,” has elitist art critic Franklin Marsh (Lee) driving artist Eric Landor (Michael Gough) to suicide. Landor’s severed hand returns to exact revenge on the mean critic. It’s in the spirit of The Beast with Five Fingers, among others, and chock-full of two-dimensional caricatures of both artists and critics. It holds no surprises, but with Lee and Gough engaged in a bit of whistling-while-they-work fun, it’s easily the best episode.\n“Vampire” feature a young Donald Sutherland who discovers he is married to… a vampire! It barely raises a pulse.\nSeen today, Dr. Terror’s House of Horrors is more camp than horror, and its appeal is one of genre nostalgia. Still, the phenomenal box office success of Dr. Terror green-lighted a second portmanteau film in 1967, entitled Torture Garden (directed by Freddie Francis and written by Robert Bloch). It contains no torture nor any garden. Burgess Meredith (in a preposterous disguise, reminding us of the Penguin) is Old Nick himself, going by the pseudonym of Dr. Diablo and moonlighting as a carnival barker who promises a tortuous exhibit that can reveal the future. “You’ll shake, you’ll shiver, but it’s all good fun,” Diablo hammily tells his patrons. Unfortunately, only one of the four tales lives up to that promise.\n“Enoch,” is the opening narrative. Michael Bryant’s inheritance money (from an uncle who took his time dying) is going to be spoiled by a mean ol’ puddy tat with a lot of doubloons.\n“Over Hollywood” has Beverly Adams discovering the fountain of youth in Hollywood with robotic consequences.\n“Mr. Steinway” might be seen as a poor precursor to Stephen King’s “Christine,” replacing a killer car with a killer piano. It’s as absurd as it sounds.\nThe first three segments are sloppily written and executed with little enthusiasm; each progressively worse, but the final segment single-handedly salvages the anthology.\n“The Man Who Collected Poe” finds Jack Palance (playing against type) as an Edgar Allan Poe-obsessed geek who may have found his soulmate in fellow fanatic Peter Cushing. However, somebody’s got something—or someone—hidden in the basement and … somebody’s got the fever, which leads to a fiery finale. Cushing and Palance clearly enjoyed playing opposite one another and their chemistry, along with clever writing, making one wish the previous segments had been as enjoyable.\n1970’s The House That Dripped Blood (directed by Peter Duffell and written by Robert Bloch) is a considerable improvement over its predecessors. Duffell lacks the visual astuteness of Freddie Francis, but he has superior stories to work with and a top notch cast. The connecting theme is the titular house, which has a bit of baggage left over from all who have resided there.\nIn “Method For Murder,” Denholm Elliott is a horror author who writes a character that becomes a tad too three-dimensional, much to his wife’s peril.\n“Waxworks” stars Cushing as an uptight retired stockbroker and lifelong bachelor who visits a wax museum, only to see a figure of a woman whom he once was in love with. Obsession and unrequited love naturally go hand-in-hand, or head-on-plate.\nIn “Sweets to the Sweet,” Nyree Dawn Porter is hired to tutor a young, motherless child (Chloe Franks) who is unloved by her cold-hearted father, Christopher Lee. Without giving too much away, let’s just say the underlying theme is one few filmmakers would dare tackle today.\n“The Cloak” is the most famous of the four episodes, remembered fondly for its absurd humor. It stars John Pertwee (best known for his portrayal of Dr. Who) as an actor who mantles the cloak of a purported actual vampire. Hammer favorite Ingrid Pitt bares her fangs and, of course, a bit more.\nAll four episodes feature strong acting, which is a rarity in contemporary horror and should be a model for genre filmmakers. Elliot’s restrained performance in “Method For Murder” is admirable enough to forgive the predictable “twist.” The stylish “Waxworks” features an equally stylish performance from Cushing, although narratively it is the thinnest episode. “Sweets to the Sweet” is psychologically intense with three powerhouse performances, making it the strongest entry. Although John Pertwee is a bit on-the-sleeve in “The Cloak,” his performance suits the tone; but, he’s no match for Pitt.\nAsylum (1972, directed by Roy Ward Baker and written by Robert Bloch) is often cited as the best of the Amicus anthologies. It opens on Dr. Martin (Robert Powell, best known as the blue-eyed Anglo-Saxon savior plopped into the Middle East in Franco Zeferelli’s Jesus of Nazareth) showing up for his scheduled job interview with Dr. Starr for a position at the Dunsmoor Asylum. Martin is met by Dr. Rutherford (Patrick Magee), however, and informed that Dr. Starr is now a patient after going insane and becoming violent. Rutherford devises a test for Martin: he will interview four patients and if he can guess which one is Dr. Starr, then he will be hired. Naturally, this segues into four tales from Mr. Bloch.\nIn “Frozen Fear,” Walter (Richard Todd) is having a sordid affair with Bonnie (Barbara Parkins). When his wife Ruth (Sylvia Syms) won’t give him a divorce, Walter grabs an axe and fills his basement freezer with prime ex-wife cold cuts. Little does Walter know that the wifey was a voodoo priestess, and when that freezer thaws, big things come a-crawling in small packages—lots of them. This vignette is the most blatantly indebted to EC comics and, as such, it’s probably Amicus’ finest twenty minutes.\n“The Weird Tailor” opens with tailor Bruno (Barry Morse) on the verge of being evicted. As luck would have it, Mr. Smith (Peter Cushing) walks into Bruno’s shop and orders a unique suit. With the promise of a hefty commission, Bruno obsessively begins working according to Mr. Smith’s very specific instructions. Unknown to Bruno, the suit is meant to resurrect Mr. Smith’s recently deceased son. Things don’t go according to plan. Previously adapted for Boris Karloff’s “Thriller”, this one can’t match the TV effort. Given a shorter running time for Asylum, Bloch was forced to excise the prologue, and with it gone, the suspense and menace are diminished. The original thriller was actually more perverse in suggesting Bruno’s wife’s sexual attraction to a mannequin. Additionally, Bruno’s character was less sympathetic, bringing a pronounced, and weird, abusive quality that is merely sketched here. Cushing is superb, bringing a sense of pathos to the character, but his part is little more than a cameo. Being more compressed, the schlock quality of the ending is more pronounced. Yet, for all of its comparative flaws, this is a strong second episode.\n“Lucy Comes To Stay” is the weakest of the four episodes. Barbara (Charlotte Rampling) has been released from the asylum to the care of her brother, George (James Valliers) and nurse Higgins (Megs Jenkins). However, Barbara has an imaginary friend named Lucy (Britt Ekland) who doesn’t care for George or the nurse. Lucy is also handy with a knife. Disappointingly, it plays out exactly as expected, and isn’t helped by lackluster performances (Rampling being the exception).\nSurprisingly, “Mannequins of Horror” is an extension of the wraparound, with the arrival of a new doctor named Byron (Herbert Lom) who has the demonic hobby of placing spirits within miniature robots and imbuing them with life, which serves as a potential gateway to immortality. Dr. Martin returns to uncover Dr. Starr’s identity in a delightfully unpleasant ending. It’s something of a mini-masterpiece that clearly proved an inspiration to later, albeit inferior films.\nPART TWO will begin with Tales From The Crypt (1972) and take us to the final Amicus anthology: From Beyond The Grave (1974).\nAnthologyChristopher LeeFreddie FrancisHorrorPeter CushingPeter DuffellRoy Ward Baker\nPrevious Post271. THE HOURGLASS SANATORIUM (1973)Next PostWEIRD HORIZON FOR THE WEEK OF 2/24/2017", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 284, "original_length": 32101, "language": "en", "language_score": 0.94, "perplexity": 304.6, "bucket": "head"}
{"url": "http://archives.library.rice.edu/repositories/2/archival_objects/79290", "digest": "sha1:Q3PNOCCFQT5HWZRUNFRNLIJYCGQU2IIV", "length": 304, "nlines": 2, "source_domain": "archives.library.rice.edu", "title": "Banc Texas Allen Parkway, completed 1983 | ArchivesSpace Public Interface", "raw_content": "Banc Texas Allen Parkway, completed 1983\nBanc Texas Allen Parkway, completed 1983, Box: 6, Folder: 4. Arthur E. Jones Architectural Records, MS 535. Woodson Research Center, Rice University, Houston, Texas. http://archives.library.rice.edu/repositories/2/archival_objects/79290 Accessed January 26, 2023.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 67, "original_length": 2736, "language": "en", "language_score": 0.82, "perplexity": 333.4, "bucket": "head"}
{"url": "http://articles.whmsoft.com/index.php?get_videos_links=0&videos_subject=Autos&identifier=4-article-30322.htm", "digest": "sha1:FRTZHJ6ZLPZDJK7S3YC4PGTQZOCTNP6A", "length": 4229, "nlines": 14, "source_domain": "articles.whmsoft.com", "title": "Autos - 4-article-30322.htm", "raw_content": "Ohmydollz Frogitaire Jurassic Pinball Kore Putt Sling Jumper 2\nFranckfort\nCalifornia To Enforce Stringent Auto Emission Regulations\nEarlier, the state of California issued proposed emissions regulations that are expected to be enforced in the next decade. The proposed regulations, when approved, could force automakers to reduce tailpipe emissions of greenhouse gases. The latter are intimately related to global warming. Parenthetically, the state is aiming to reduce 30 percent of harmful gas emissions by passing stringent auto regulations.\nCalifornia represents about 10 per cent of the overall American auto market. Auto analysts expect that if the proposed regulations are adopted later this year after the review process, it would be the very first limits in the United States regarding auto emissions of gasses linked to global warming. In addition, other states in the nation are expected to follow same regulations to further promote the wellbeing of its citizens and their environment. At least four Northeastern states are observing what California is currently doing.\nThe California Air Resources Board, the one responsible of the proposed regulations, said that the stringent emission regulation is made in response to a state law enacted in 2002. Said law requires automakers to produce cars, pickup trucks, sport utility vehicles and minivans that emit 30 per cent less greenhouse gases on average by 2015.\nThe proposed regulations are expected to increase the market value of new vehicles. However, the boards did not go into specifics by divulging the anticipated increase. With the proposed regulations, automotive emission parts are expected to become expensive due to the upgrades and innovations to come up with reduced greenhouse gases emissions. On the one hand, automakers are trying to prevent the proposal from becoming a law. California's actions have tremendous repercussions for the auto industry because the state represents about 10 per cent of the nation's car market.\nThe proposal entails added expenditures to automakers because of the required studies, testing, materials and modifications. Consequently, there is no assurance of a greener pasture attributed to the enhancements of emission control parts.\nThe upgrades needed to meet California's proposed regulations could add thousands of dollars to the price of a new vehicle, said Eron Shosteck of the Alliance of Automobile Manufacturers. \"We are happy to offer these efficient fuel-saving technologies. But consumers just don't want to buy them... Automakers believe consumers should have the option to choose.\" He added that the regulations would result in vehicles that are \"lighter, smaller, less powerful, and less able to do what consumers want.\"\nCalifornia has the dirtiest air in America. This is the very reason why several movements have been established to take care of the matter. In addition to these cause-oriented movements, the state's Air Resources Board is also determined to promote a cleaner air to preclude illness and other hazardous effects of global warming.\nGlobal warming, the continuous increase of Earth's temperature, is said to be mostly attributable to human activities that results to increased atmospheric concentration of greenhouse gases like carbon dioxide, a colorless gas that rises into the atmosphere and traps heat. The situation further leads to warming of the atmosphere by escalating the greenhouse effect.\nGlobal warming influences both the natural environment and human life. Its effects include sea level rise, agricultural repercussions, thinning of the ozone layer, extreme weather events and spread of disease like malaria and other infectious maladies.\nCalifornia officials said automakers could reduce carbon dioxide emissions by improving gas mileage. Less fuel consumption would result in fewer emissions. They further noted that gas mileage could be improved with available technology, such as high-tech transmissions that shift automatically into the most efficient gear.\nAbout the Author: Joe Thompson is the owner of a successful auto body shop in Ferndale, California. This 38 year old is also a prolific writer, contributing automotive related articles to various publications.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 83, "original_length": 7072, "language": "en", "language_score": 0.95, "perplexity": 234.6, "bucket": "head"}
{"url": "http://ateamtriad.com/testimonials/", "digest": "sha1:UCESLIJ6VWKQVQZQFPB5DOS7UNWJOWAC", "length": 3443, "nlines": 24, "source_domain": "ateamtriad.com", "title": "Testimonials - Advantage Inspection", "raw_content": "What our clients say about our service.\nThanks for the great Job! (L.C.)\nTI loved working with Bud and Norman. They were so thorough and explained everything so well, both verbally and in the written report. I was able to look back at the detailed report and refer to pictures and descriptions when speaking to my contractors, which was a great help.\nMr. Albertson’s reports are nicely detailed, and his explanations well-grounded in reality. He made it easy for us to triage what needed to be done right away, vs things that we can wait to address.\nWe have used Bud twice now both for an existing older home and a new construction. In each circumstance he is very thorough and thoughtful in his reporting.\nThank you for your services Bud and Norm. They were very helpful in uncovering additional factors with the home that I had not anticipated. (J.W.)\nI enjoyed meeting you both yesterday and thank you again for shining in your profession. You were very informative and your report confirms it. Thanks for aiding us in being more informed concerning our major purchase. Merry Christmas to you both! (W.J.)\nThank you Bud! It is a pleasure working with you! (S.B.)\nThanks for making this an enjoyable experience for us! I thought y’all were very professional ! (K.R.)\nI can say that I had a pleasant experience with using this company for my home inspections. My report was easy to read and I have actually been using it to help me keep track of what needs to be done. I would highly recommend this company to anyone that wants a detailed Home Inspection (N.S.)\nVery thorough and impactful toward making final negotiations on the price. The report was easy to read. The face-to-face explanation was friendly and professional. Thank you. (R.O.)\nI felt your inspection was thorough and easy to understand. Our seller accepted your report and did a good job of making the necessary repairs. Thank you. (R.N.)\nExcellent all the way around! Thanks! (J.C.)\nSuperior service all around. Extremely thorough process and very comfortable people to work with (A.P.)\nAs investors, we have worked with several different inspectors. This is the first time we have felt completely satisfied, and did not feel that we needed to keep searching for an inspector who would give us better service. Glad we found you! (J.L.)\nCould not be more pleased with your service, thank you so much Bud. (W.H.)\nPleasant experience. Very informative. (S.D.)\nI was very pleased with the amount of information given and the explanation of it all, along with the pictures. I have been amazed with the follow up contact. Thank you so greatly and may God continue to bless all of your endeavors, personal and business wise. (T.R.)\nThank you so much for the reports. Also thank you again for spending the time with me to explain each item and using the pictures as examples. Your report will help to identify what to do and where. It will certainly make it easy for me gets these items corrected in a timely manner.\nAfter working with you, I can not understand why all inspectors do not do their job the way you do yours. It was a pleasure.\nChristine (C.)\nI just wanted to say thank you for doing such a great job on the inspection, your thoroughness means alot. I am not purchasing this home but, will definitely use you as the inspector on the next house I find. (S.F.)\nService was greatly appreciated, thank you so much (P.O.)\nthanks for everything. The service was great (S.O.)", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 105, "original_length": 12912, "language": "en", "language_score": 0.98, "perplexity": 322.4, "bucket": "head"}
{"url": "http://barefoothallucination.weebly.com/blog/updaty-posty-thingy", "digest": "sha1:T6CDMGXJ2NTPTFENPBTNBFNIZUBDO527", "length": 1537, "nlines": 5, "source_domain": "barefoothallucination.weebly.com", "title": "Updaty posty thingy - Barefoot Hallucination", "raw_content": "Updaty posty thingy\nSooo....\nChainmaille was a disaster. I need someone to show me how to construct. It was moot anyway, as I had an anxiety attack and barely made it in to the con. I am so embarased, but glad it wasn't a long term thing.\nI am still working on getting the chaim maille done. Maybe it will look fine. I don't know. I also need to work on the scale spoon maille.\nRight now, though, my main focus is finding a job. I thought I had extended unemployment until I was done wtih school. Turns out that was not entirely true, and now I am kind of up a creek. I have been saving money, so right now I have been paying bills with my savings. However that is also about to run out. I have applied for abawd. I do not know if I will get it, or how long it will take to kick in. Hopefully soon. I have had a bunch of interviews, and I am waiting to hear back. I have shotgunned a ton of applications for any and all jobs, no matter what they pay or how much experience they ask for. In the mean time I am kind of stuck. If you are reading this and feel like helping out, feel free to click the Tips/Supply Fund button and give a little. It would be much appreciated. Also, if you have job leads in the Portland, OR area, feel free to leave them in the comments. I am kind of tired of being in this spot. It seems I am here every couple of years. I just want to find a job where I can stay for 5-10 years without worrying about where the next paycheck is going to come from. Apparently that is too much to ask from the universe. Sigh.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 294, "original_length": 5560, "language": "en", "language_score": 0.99, "perplexity": 296.8, "bucket": "head"}
{"url": "http://bastum.us/2022/11/05/", "digest": "sha1:WUTRNJACWOBNKOUJJOAQEUPC5UP4H75E", "length": 5221, "nlines": 13, "source_domain": "bastum.us", "title": "November 5, 2022 – bastum", "raw_content": "Home - 2022 - November -\n5Nov, 2022\nBernina District 2022 Top Things To Do Bernina District Travel Guides Top Recommended Bernina District Tickets For Attractions, Hotels, Places To Visit, Restaurants And Restaurants\nThe Bernina line runs from Italy to Switzerland, starting/ending in the Italian city of Tirano and starting/ending in the Swiss city of Chur. It passes through some of Switzerland’s most picturesque landscapes and is available for travel in both winter and summer. A train ride through the Swiss Alps is beautiful at any time of the year.\nItalian high-speed trains are booked and have dynamic prices, cheaper in advance than on the day. The reservation opens up to 4 months in advance, depending on the train. Normally, you will need to change trains at least once if you want to travel from Chur to Tirano on these regular local trains.\nAt its highest point, the train is 7392 feet above sea level. You can also book your one-way trip with the Bernina Express and then use the regional trains to reach your next destinations, which would be included in your Swiss Travel Pass. I would also suggest doing this if you plan to get on and off the train. You will have to pay for seats again to return to one of the normal trains, as your tickets will only apply to the panoramic train. It seems that the windows of the normal wagons of the regional train open, but from what I could see, I could not reach those cars from where I was sitting. You can also stop at one of the small towns along the way to get a closer look.\nIn less than four hours, you’ll experience the historic mountain passes of Albula and Bernina, the famous Landwasser Viaduct, with endless views on either side of the train as you twist and turn through the landscape. The 6 limestone arches with the red train, which travel through them, are iconic and became a symbol of scenic train rides in Switzerland and Europe. Shortly after leaving Tirano, the Bernina Express begins to drive through the streets while cars stay at traffic lights, allowing it to pass. The train then climbs up the valley just outside Tirano and continues all the way to the mountainside thousands of meters above sea level. Ospizio Bernina is the summit and highest point of the route at 2,253 meters above sea level.\nTravel with the Bernina Express can also be booked to/from Chur. This sensational scenic drive takes you along some of Switzerland’s most beautiful routes, such as the Golden Pass, Glacier Express, and Bernina Express. In Interlaken you travel to the top of Europe: the Jungfraujoch. Day 2, travel from Zurich to Chur by Swiss InterCity train, then from Chur to Tirano on the fantastic Bernina Express, then Tirano to Milan by regional train trenord, as seen in the previous schedule. You can use the morning train all year round or the evening train in summer. This is the 3-car Allegra unit, coupled with the panoramic cars of the Bernina Express.\nThis is a regional ticket with a fixed price, tickets cannot be sold out, the reservation is not necessary or possible, so you can safely buy close to the departure date, without having to commit your money in advance. In fact, tickets can be purchased at the station on the day itself at this price if you wish. You can avoid paying a reservation fee if you travel in the non-reserved seats on the Allegra unit with the Bernina Express. Since the whole trip only takes 4 hours, you can easily do it in one day.\nThe Express is an hour and a half by train from Zurich and runs all year round. After a break of a few hours, the train departs from Tirano station, making its way through the Treno rosso del Bernina town of Tirano and back along the same route before arriving back in Chur in the late afternoon. The whole trip takes a whole day to complete and can start at both ends.\n2nd Class1st classSingle travel63101Tour116222Sterreservering+10 CHF+ 10 CHFImportantly, as shown in the table, an additional CHF 10 will be charged for seat reservation. These seat reservations can be booked in advance, we recommend this. Booking fees vary depending on the season you are travelling. If you want to travel on the Bernina Express during the cheapest time of the year, we recommend that you travel from November to January/February. It is recommended to reserve a seat if you are travelling during peak hours or want to guarantee a seat on board the daily express trains. You can reserve your seat at a Swiss train station or online.\nTaxis are also not a viable option, as the journey takes several hours. The best way to get from Milan to St. Moritz is via a combination train and bus, which takes about 4.5 hours when all is said and done. You can take a train from Milano Centrale station to Chiavenna, and then change to bus line 4 to St. Moritz Bahnhof. The bus we were travelling in was bad with a clear mechanical problem from the moment we boarded in Milan.\nThey pride themselves on the Bernina Express going from glacial landscapes to palm-friendly climates within hours. They speak enthusiastically about the 7,638 meter high Bernina Pass. And they can’t help mentioning the line’s impressive tunnels and viaducts. It looks like a beautiful train ride and the photos are spectacular.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 44, "original_length": 5801, "language": "en", "language_score": 0.95, "perplexity": 277.6, "bucket": "head"}
{"url": "http://billstatus.ls.state.ms.us/documents/2007/html/SC/SC0542IN.htm", "digest": "sha1:M3NLNXCG4OMJ6T5YZ5G5NOCM4M5ZA6KW", "length": 3256, "nlines": 27, "source_domain": "billstatus.ls.state.ms.us", "title": "SC 542 (As Introduced) - 2007 Regular Session", "raw_content": "To: Rules\nBy: Senator(s) Browning\nSenate Concurrent Resolution 542\nA CONCURRENT RESOLUTION COMMENDING AND CONGRATULATING INGOMAR COACH NORRIS ASHLEY FOR ACHIEVING THE RECORD OF ALL-TIME COACHING VICTORIES IN MISSISSIPPI BOYS BASKETBALL HISTORY.\nWHEREAS, President Richard Nixon was in the White House and those Amazin' Mets won their first World Series when Norris Ashley launched his coaching career in 1969. Little did Coach Ashley realize that, 38 seasons later, he'd become the winningest coach in Mississippi boys basketball history; and\nWHEREAS, led by freshman guard Tyler Jarvis' 29 points, Ashley gained his 905th career victory Monday night, December 11, 2006, as Ingomar beat East Union 67-38 at home before an estimated crowd of 500; and\nWHEREAS, Ashley, 59, is 905-412 in 38 seasons at Coahoma County and Ingomar, his alma mater. He surpassed Sam Richey, 68, who went 904-414 at Jumpertown, Wheeler and Baldwyn and won six State Championships from 1967-2005; and\nWHEREAS, Ashley has won four Boys State Tournament titles with the Falcons; and\nWHEREAS, a Delta State University graduate, Ashley has spent 36 of his 38 seasons at tiny Ingomar, a rural Union County town. Coach Ashley does not regret going back to his hometown school; and\nWHEREAS, all-time coaching victories in Mississippi boys basketball history are:\nRECORD COACH\n· 905-412 Norris Ashley\nCoahoma County, Ingomar (Active)\n· 904-414 Sam Richey\nJumpertown, Wheeler, Baldwyn\n· 867-326 Roland Ladner\nSellers, Harrison Central,\nHancock, Pearl River Central\n· 866-180 Bert Jenkins\n· 862-370 Isaiah Peterson\nShelby Broad Street, Coahoma County (Active); and\nWHEREAS, the man Ashley overtook tipped his hat to his coaching colleague. \"I knew it was coming,\" said Coach Richey, who claimed the state record with his 868th victory when Baldwyn topped Bruce 68-60 on January 8, 2002. \"I enjoyed it while I had it. He can enjoy it for a while now, I guess.\" On several occasions, Ashley and Richey went head-to-head in memorable Ingomar-Wheeler matchups; and\nWHEREAS, \"I've always had a real high regard for him,\" Coach Richey said. \"He's one of the best coaches in the state, if not the best. He just knows the game, and he takes advantage of the strengths of his team. His players are real disciplined, and you can tell they're always well-coached\"; and\nWHEREAS, Coach Ashley has no timetable on when he'll walk away from the basketball court. Does he dare to dream of 1,000 wins? Ashley said, \"I'll just take it year by year\"; and\nWHEREAS, it is with great pride that we recognize this legendary coach who has added to his legend with this 905th win and brought honor to his school, his community and to the State of Mississippi:\nNOW, THEREFORE, BE IT RESOLVED BY THE SENATE OF THE STATE OF MISSISSIPPI, THE HOUSE OF REPRESENTATIVES CONCURRING THEREIN, That we do hereby commend and congratulate Ingomar High School Coach Norris Ashley for achieving the record of all-time coaching victories in Mississippi boys basketball history, and extend to him, his family and his school our best wishes for future successes.\nBE IT FURTHER RESOLVED, That this resolution be presented to Coach Norris Ashley and be made available to the Principal of Ingomar High School and the Capitol Press Corps.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 30, "original_length": 3362, "language": "en", "language_score": 0.96, "perplexity": 330.4, "bucket": "head"}
{"url": "http://blog.greenconsciousness.org/2005/02/us-afghan-womens-council.html", "digest": "sha1:J56BFT3Z6EKHHQ2N4WUKU4V4BYF7CSHU", "length": 14656, "nlines": 89, "source_domain": "blog.greenconsciousness.org", "title": "Green Consciousness: The U.S.-Afghan Women's Council", "raw_content": "The U.S.-Afghan Women's Council\nAfter the fall of the Taliban, the United States launched a historic initiative to help elevate the status of women in Afghanistan. To accelerate progress, President George W. Bush and President Hamid Karzai announced the creation of the U.S.-Afghan Women's Council (USAWC) on January 28, 2002.\nThe Council promotes public-private partnerships between U.S. and Afghan institutions and mobilizes private sector resources to help Afghan women. Specifically, the Council seeks to identify concrete actions to bring real and practical benefits to the women of Afghanistan and to enable them to participate and take leadership roles in the political and economic life of their country.\nTo this end, the Council has made education and microfinance its top priorities.\nToo bad - under patriarchy - refuge and shelter has to be the top priority. Battered women's villages - transitional living space free from abuse is the first need. But if you are from the privileged classes, you do not understand the urgency of this need.\nhttp://news.bbc.co.uk/2/hi/africa/4292425.stm\nThe Council meets twice a year, alternating between Kabul and Washington, D.C., to discuss programs and priorities for assisting Afghan women and to review progress.\nUnder Secretary of State for Global Affairs Paula Dobriansky co-chairs the Council with the Afghan Foreign Minister and the Afghan Minister of Women's Affairs. What are their names?\nSee http://usawc.state.gov/c10666.htm for more information about Council members.\nTake a look at these people. Not one has ever organized victims of patriarchal violence. They are so removed from that world. They are wealthy. They have fundraising credentials. There is no evaluation or input by feminists who have actually changed resistant, misogynist institutions within the US - civil rights organizers and feminist organizers with track records of success.\nThis is primarily the fault of those organizers who have refused to work with this president even to free their own kind from slavery. Would these modern day feminists have refused to support the abolitionist movement because Lincoln was a Republican? But it is also the fault of this administration who has not appointed any real feminists to the US-Afghan Women's Council to assist in the Middle East efforts.\nThe Council's fifth meeting was held in Washington, DC in the Treaty Room of the White House on June 15, 2004. Members and invited Afghan and American special guests discussed several key issues, including the Afghan national elections, health care, and jobs.\nPresident Bush, President Karzai, Secretary Powell, National Security Advisor Rice, and Secretary of Health and Human Services Thompson met with the group. First Lady Laura Bush honored the Council with a lunch.\nMore than 20 Afghan women attended the meeting and the lunch, including four Afghan Fulbright scholars (a U.S. Department of State educational exchange program), four Afghan women judges on a USAWC training project, and 12 U.S. Department of Agriculture Cochran Fellows in the U.S. for a U.S. Department of Agriculture program for job training in agribusiness.\nThe fourth meeting of the Council was held in Kabul, February 24-26, 2004.\nDiscussions focused on:\neducation, specifically the Teacher Training Institute and Afghan Literacy initiative; microfinance;\nthe new constitution;\nand the elections in Fall 2004.\nThe delegation visited a women's center and met with project managers of programs supported by the U.S. Government and by the U.S.-Afghan Women's Council.\nThe Council's third meeting, in Washington, D.C., July 15-16, 2003, focused on the educational needs of women and girls, job skills training, business development, and the upcoming elections.\nThe delegation met with First Lady Laura Bush and National Security Advisor Condoleezza Rice at the White House. Secretary Powell hosted a luncheon in their honor.\nAt the Council's second meeting in Kabul, the U.S. announced that it would provide $2.5 million for women's resource centers in 14 of Afghanistan's provinces. The Council also committed $1 million in education and exchange programs for the centers. The centers should include shelters for women who wish to escape abuse and become self sufficient.\nPrograms at these centers focus on basic education literacy, microfinance and small business opportunities, human rights education, and the development and management of non-governmental organizations (NGOs).\nInaugural Meeting\nThe inaugural meeting took place in Washington, D.C. in April 2002. In response to a request from the Afghan side, the Council later announced its first initiative would bring Afghan women who work in government ministries to the United States for an educational exchange program.\nThe program focused on computer training, leadership, and management training, and other skills vital to their positions.\nPolitical Participation Women's Resource Center.\nUSAID is building 17 Women's Resource Centers in Afghanistan.\nFour centers have been completed and two more are scheduled to finish in the near future.\nThe centers will support outreach, advocacy, and policy formation of the Ministry of Women's Affairs, and create a space in rural provinces for training women in education, health, job skills, leadership, legal awareness, and political participation.\nThrough USWAC women executives of AOL(Time Warner) donated $60,000 for the construction of the resource center in Parwan.\nAfghan Women Leaders Connect (AWLC) ($10,000).\nThis contribution supported a conference in Kabul in Fall 2004 hosted by the Women and Children Legal Research Foundation focusing on legal rights. This is in addition to the Summer 2004 grant of $10,000 that AWLC provided to the International Association of Women Judges to supplement the $75,000 grant by the State Department's International Narcotics and Law Enforcement Bureau, which trained four Afghan women judges in civil and family law.What kind of civil law? Secular? Where is it codified?\nDigital Video Conference.\nThe Council has used digital videoconference (DVC) technology to connect Kabul, Washington, DC and New York, setting up links for discussions and mentoring sessions between women in these cities.\nThe DVC in November 2003 focused on women's political participation in Afghanistan's draft constitution and the Afghan elections in 2004.\nTheDVC in April 2003 focused on the topic of women and business.\nEconomic Opportunities Community Banks.\nThe Council views microcredit as an important means of helping women gain self-sufficiency through starting their own businesses. Through an original $10,000 donation to the Council from Daimler-Chrysler, the Foundation for International Community Assistance (FINCA), a leading NGO in microfinance, helped start two village banks in Herat.\nDaimler-Chrysler contributed an additional $25,000 in February 2004 to construct another five community banks to support microfinance loans for women in Herat province.\nWith Additional funding from the U.S. Government and other donors, FINCA expects to assist more than 30,000 clients in Afghanistan over the next 5 years.\nU.S. Bureau of Educational and Cultural Affairs/USAWC Department of State Grants ($750,000).\nFive grants were awarded to organizations for proposals that include:\nbusiness and political leadership training (grant to World Learning);\nentrepreneurship training (grant to Women for Afghan Women);\neducation and literacy training (grants to American Council for International Education and Institute for Training and Development);\nand women's leadership training (grant to University of Delaware).\nSeventy-one women have taken leadership training under the University of Delaware grant thus far.\nThunderbird Graduate School of International Management.\nFifteen Afghan women successfully completed an advanced entrepreneurship training in January 2005. The participants aim to start businesses that would create jobs for women and to serve as mentors/teachers in Afghanistan.\nGlobal Summit of Women ($40,000).\nSupported by USAID, a delegation of nine Afghan women attended the 2004 Global Summit in Seoul, Korea, in May to discuss trade opportunities and receive entrepreneurship training.\nArzu Carpet Initiative ($530,000).\nThis program provides training and literacy skills to Afghan women in the hand-knotted carpet industry. Connie Duckworth, a USAWC member, provided the seed money to get the project started. Arzu placed its first carpet order on International Women's Day (March 8, 2004). The project Arzu (which means \"Hope\" in Dari) not only creates jobs and a cottage industry, it also re-circulates some of its profits to support microcredit initiatives and additional training for women.\nU.S. Department of Agriculture Cochran Fellowships.\nTwelve women representing five provinces came to the United States in Spring 2004 for job training as managers and technicians in agribusiness.\nHandicraft Training ($130,000).\nThe Global Summit of Women (July 2002 in Barcelona, Spain) donated approximately $10,000 for job-skills training for women. Through this program, Shuhada, a local organization, is training women in weaving skills. At the conclusion of the program, the women will receive their own looms to produce textiles for market. At the conclusion of the program, the women will receive their own looms to produce textiles for market. This is a big deal. Ever since the film \"Afghan Unveiled\", many people have wanted to get looms to Afghan women living in caves in the Bamiyan geographic location: Herat ? women and children who were living in caves without any source of fuel, nor livestock nor food. Nayak which does have a school for girls, built by American Friends Service Committee, is in central Afghanistan, near Bamiyan.\nIt is unclear from this fact sheet as to whether the Bamiyan women will receive the looms. More info as to how to contact Shuhada or Global Summit of Women directly would be appreciated.\nMedia Women Journalists.\nThe PBS broadcast in November 2004 of the film \"Afghanistan Unveiled\" created an opportunity for mentoring for another Afghan journalist, the fourth that PBS, through USAWC auspices, has trained in the U.S.\nPBS provided modern digital video production and editing equipment for the women video filmmakers to use in Afghanistan and training videos for use at AINA, a Kabul-based NGO devoted to media training.\nThe film \"Afghanistan Unveiled\" for which PBS paid $20,000 in royalties and rights depicts life under the Taliban and the journalist's' journey for the truth. PBS has also optioned the rights for AINA's next film about women's human rights called \"If I Stand Up.\"\nThese films and several short videos to encourage women to vote were made by the \"women's project\" at AINA with Department of State and USAID funding (from Summer 2002 through the October 2004 elections).\nThe Asia Foundation (TAF) was a partner on the original \"Afghanistan Unveiled\" project in 2002 and continues to host trainings and screenings of the film (California, Maryland and Sundance Festivals.)\nHealth Health Advisory Committee.\nOn July 26, 2004 the Council's newly formed Health Advisory Committee sponsored a special session to discuss health issues and create public/private partnerships to utilize resources for greater impact and sustainability.\nUnder Secretary Paula Dobriansky hosted the organizing meeting for the committee.\nMidwife Training. The $5-million Rural Education and Community Health Care Initiative (REACH) provides health-related accelerated learning and basic literacy training for women and girls. Training will take place in the Women's Centers and will target provinces with the highest maternal mortality rates such as Ghazni, Baghlan, and Badakhshan.\nIn April 2004, REACH graduated its first 25 midwives from the program, after they completed an 18-month program in Jalalabad. This pilot program is being replicated across Afghanistan. For each new midwife, the U.S. is supporting a lifetime of lives saved.\nAfghan Family Health Book.\nIn Fall 2004, U.S. Health and Human Services (HHS) Secretary Tommy Thompson initiated the roll-out of the \"Afghan Family Health Book\" across Afghanistan. This \"talking book\" provides useful and practical information about health practices and hygiene, focusing on health promotion and disease prevention.\nThe books are being distributed via hospitals, clinics, and women's. The project was developed with Leapfrog Enterprises Inc., a developer, designer, and manufacturer of technology-based educational products.\nEducation Fulbright Scholarships.\nFive Afghan women were awarded Fulbright scholarships for the academic year 2004-2005 for advanced graduate-level study in the U.S. Women's Teacher Training Institute ($5 million).\nIn cooperation with USAID, First Lady Laura Bush announced a USAWC Initiative to establish a Women's Teacher Training Institute in Kabul in tandem with The Afghan Literacy Initiative, designed to help teach basic literacy to Afghan women in rural areas of Afghanistan.\nThe Institute opened in September 2004. The Institute's first program, Afghan Literary Initiative for 200 rural villages, is in progress.\nTeacher Training.\nIn 2002, the USAWC initiated a teacher-training exchange to bring 30 Afghan women teachers to Nebraska every six months for training. In turn, these women will train other teachers in Afghanistan.\nAdopt-a-school Program.\nChurch communities in Texas are providing their adopted school with supplies, textbooks, and training.\nU.S. Leadership Management and Computer Education.\nThe Council's first major program, in September and October 2002, brought 14 women from various Afghan government ministries to the United States for an educational exchange program.\nDuring their four-week stay, they received training in computer skills, proposal writing, communications, and leadership management.\nEach participant received a laptop computer to use while training in the United States and to take home to use in Afghanistan.\nThe women met with President George W. Bush and National Security Adviser Condoleezza Rice at the White House, and with Secretary of State Colin L. Powell at a Department reception held in their honor. They also had the opportunity to interact with senior policymakers, Members of Congress, government agency officials, and representatives of non-governmental organizations.\nIn Austin, Texas, they studied the interaction among federal, state, and local entities. Their program concluded in New York City where the participants met with representatives of the United Nations.\nSee http://www.state.gov/g/WI/ for International Women's Issues", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 669, "original_length": 30096, "language": "en", "language_score": 0.95, "perplexity": 190.1, "bucket": "head"}
{"url": "http://blog.winningponies.com/tag/laffitt-pincay-iii/", "digest": "sha1:B5GXQTWNCOF4W5FR23FWKPTXO6HA7FYS", "length": 2082, "nlines": 9, "source_domain": "blog.winningponies.com", "title": "Laffitt Pincay III at WinningPonies.com Blog", "raw_content": "Posts Tagged ‘Laffitt Pincay III’\nAgainst the Odds – Finding Your Edge\nposted on October 30, 2019 in Blogroll, General Discussion, Handicapping, Horse Racing, WinningPonies.com | 1 Comment >>\nThere are about a thousand reasons gamblers win or lose. If you don’t believe me just ask them. – As we approach the holy of holy weekends for horseplayers there is mental flossing that must take place. You know, start doing last-minute homework and watching replays. When they conduct the post position draw […]\nFiled under Breeders Cup, Britney Eurton, Ed Meyer, Gabby Gaudet, Horse Racing Nation, John C. Englehardt, Laffitt Pincay III, Nick Luck, Nov. 1 – “Future Stars Friday” $1 million Breeders’ Cup Juvenile Turf Sprint $1 million Breeders’ Cup Juvenile Turf $2 million Breeders’ Cup Juvenile Fillies $1 million Breeders’ Cup Juvenile Fillies , Nov. 2 $1 million Breeders’ Cup Filly & Mare Sprint $1 million Breeders’ Cup Turf Sprint $1 million Big Ass Fans Breeders’ Cup Dirt Mile $2 million Maker’s Mark Breeders’ Cup Filly & Mare Turf, Santa Anita, Scott Hazelton, TVG, TVG.com, Winning Ponies, Winning Ponies Internet Show\nRanting, Raging, and Shoveling Snow\nposted on February 20, 2015 in Blogroll, Free Picks and Tips, General Discussion, Handicapping, Horse Racing, WinningPonies.com | No Comments >>\nI don’t know about you, but I’m sick of winter. Take it all back. I don’t want to go sled riding, take part in a snow ball fight, or even make snow cream. I want this crap to melt, or be sent off somewhere there’s a drought. OK, I think I’m done for a little while. […]\nFiled under Aaron Vercruysse, Across the Board, Against the Odds, and Gary Mandela, Betfair, BOGO, Brad Free, Breaking Bad, Brian Nadeau, Capital OTB, dollar beers, Ed Meyer, First Call, Happy Hour Bankroll, Horseplayernow.com, HRTV, HRTV Rewind, Inside Information, Jeff Siegel, John Engelhardt, Laffitt Pincay III, Mad Men, Peter Lurie, Player pools, Pursuit of the Cup, Saratoga, Scott Hazelton, Shares, Speedo, The National Racing Report, The Player, TVG, Winning Ponies, Winning Ponies Internet Show", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 249, "original_length": 5704, "language": "en", "language_score": 0.77, "perplexity": 317.8, "bucket": "head"}
{"url": "http://bluegrass-conceptsgifts.com/all-you-need-to-learn-about-biography/", "digest": "sha1:F5JYKST2V2DGRDSOIUTAFICEQYY5S773", "length": 6536, "nlines": 17, "source_domain": "bluegrass-conceptsgifts.com", "title": "All You Need To Learn About Biography. – blue gres", "raw_content": "All You Need To Learn About Biography.\nNo Comments on All You Need To Learn About Biography.\nA bio is an in-depth account of an individual’s life. This kind of writing consists of more than just standard truths concerning an individual’s life, yet likewise the individual’s experiences. Bios are frequently interesting to review and also are exceptional methods to discover people you appreciate. Bios are additionally an excellent means to learn more regarding on your own.\nThe first step in composing a bio is to select a subject you have an interest in. It’s helpful to select a topic that will be compelling to your viewers and that reflects the subject’s interests and also individuality. Furthermore, great biographical writing consists of styles that attach the individual to the global. Nonetheless, forced styles will certainly make the work audio contrived and can trigger the reader to lose faith in the account. For that reason, you need to gain the visitor’s trust before carrying on to other aspects of the subject’s life.\nBio is a genre of literary works that has been around for centuries. It has actually been covered great leaders from the old world to the modern globe. The earliest biographies were historical documents, however as time took place they turned into epic tales. In old times, Plato’s Apology recounted the life of the thinker Socrates, as well as the Gospels of the Christian Bible feature four biographies of Jesus Christ. In the 20th century, biographers have begun to integrate mental concepts into their work. The outcomes of these adjustments in composing are numerous work of arts of biographical history.\nAlong with describing the accomplishments of an individual, a biography must additionally describe the person’s personal history as well as the obstacles that she or he conquered. The visitor must have the ability to identify with the individual in the bio as well as really feel a link with the subject. Bios are frequently the most effective means to present on your own to a reader, and they can be placed anywhere online or offline. To produce a bio that works as well as appealing, follow these pointers:\nA biography can be concerning a single person or a group of individuals. As an example, Captain Charles Johnson’s “A General History of the Pirates” (1724) catalogued the lives of the infamous pirates and also assisted create popular images of pirates. A bio can additionally concentrate on a smaller sized team, such as a musician collective. The musical “Hamilton” is a superb example of a bio. The work of an author can also concentrate on a single person in an attempt to produce a larger effect.\nA biographer who recognizes his subject directly remains in an one-of-a-kind setting to use a more total view of the topic’s life. By communicating directly with the topic, the biographer will certainly be able to supply an exact image of the topic’s personality as well as behavior. The biographer’s job will be to uncover the objectives behind activities and also to uncover the personality shape of the topic.\nBiographies can be categorized in two kinds: literary and also historical. Literary biographies concentrate on authors as well as artists as well as typically blend typical narratives with explorations of their innovative output. One of the most renowned instances of this type of biography are the renowned Jackson Pollock biography (2014) and Savage Appeal: The Life of Edna St. Vincent Millay.\nPrior to starting to compose a biography, students need to first choose what kind of subject they desire to blog about. Then, they need to start with a timeline of the topic’s life. If they’re unclear of the sort of subject they wish to blog about, they can practice creating a short bio of a relative. Once they have actually created the timeline, they can carry on to the looking into stage.\nA biography is an useful book that information the life of a person. It can be a complete account of a person’s life, or it can focus on one crucial occasion in their life. The writer of a biography chooses what details to consist of, yet many bios consist of basic facts as well as the time as well as place where the individual lived. Some biographers consist of even more details regarding their subjects’ lives, such as their childhood years or coming-of-age occasions.\nIf you’re composing a biography for an audience, you need to decide that your audience is. This will certainly help you write a biography that’s appropriate for the function. Remember, your biography is the very first factor of contact between you and also your audience. Be as useful as feasible, however also keep in mind that it can be individual or funny. For instance, a biography for a college application should be formal, while a bio for a social networking site should be more playful.\nBiographers have a tough job. They need to stabilize their obligation to share the truth about an individual against the individual distress they trigger to others. Regardless of the many intricacies, no global requirement of “biographical morality” has actually been developed. Biographers of the twentieth century face challenging times, and also custodians of important persons refuse to give access to all their papers.\nBiographies can likewise be read for entertainment. A current Broadway play, Hamilton by Lin-Manuel Miranda, is a great example of this. It was inspired by Ron Chernow’s 800-page Alexander Hamilton. Biographies of famous people additionally provide essential context and also help the public comprehend the people they appreciate.\nThe goal of a bio is to take the visitor on a trip with the life of a certain person. Whether it is a well-known historical number or an unsung hero, a biography will certainly give the visitor with an introduction of the person’s personality and life lessons. A biography must additionally offer a clear picture of an individual’s characteristic, along with their achievements as well as failings. The visitor needs to feel like they are connecting with the subject in person. click here\nSome biographers use diaries as a basis for a bio. If the author is writing a bio from his/her journals, it is very important to make the diaries sequential as well as meaningful. Flashbacks and flashforwards are additionally typical. The reader ought to still adhere to the chronological order to make it very easy to adhere to the writer’s life story.\n← Helpful Tips From Professionals In Car Dealer. → This Is Why Specialist Affiliate For Women Is So Famous!", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 60, "original_length": 7660, "language": "en", "language_score": 0.96, "perplexity": 222.3, "bucket": "head"}
{"url": "http://bluegrass-conceptsgifts.com/tips-on-composing-a-bio/","digest": "sha1:KW4VHIFJV42VS3HL2BKKLT6B5THEVDEA", "length": 5701, "nlines": 23, "source_domain": "bluegrass-conceptsgifts.com", "title": "Tips on Composing a Bio. – blue gres", "raw_content": "Tips on Composing a Bio.\nNo Comments on Tips on Composing a Bio.\nCreating your very own biography can be an enjoyable as well as interesting process. Yet it is essential to understand the crucial facets to include in your story. Here are some pointers on writing a biography:\nMultimedia bio\nPutting in the time to produce a multimedia biography is a worthwhile exercise. This workout will certainly confirm to be beneficial to the student’s overall knowing experience, as well as even better is the possibility to present some excellent multimedia skills. The resulting project will certainly act as a precursor of the pupil’s future ventures.\nIn the name of brevity, the complying with is not a detailed list of all the multimedia tasks of the aforementioned checklist. While many pupils went with the requisite digital cams and also microphones, some selected to spend lavishly on an iPad or 2. As an included perk, the Hunt Libraries were open for service 24-hour a day during finals, making this an excellent possibility to make the grade. This is in addition to the myriad of multimedia resources available in the Hunt Libraries’ vast archives.\nAs it turns out, producing a multimedia biography isn’t all that challenging. The procedure requires editing and enhancing images of the based on use recordings. This need to make the students’ lives less complicated in the long run. It is likewise a good chance to display the trainee’s creative thinking by having them come up with their very own concepts for the following model. There are a number of different projects currently in the jobs, every one of which will deserve the student’s attention.\nWhether you are a pupil or a grown-up, composing a memoir is a powerful way to share your experiences with others. By sharing your life story, you can motivate and also inform viewers, and help them learn more concerning themselves.\nWhen creating a memoir, it is very important to consist of details regarding significant moments in your life. These moments are essential since they form how you come close to life in the here and now. It is additionally a great concept to include your family history, as well as an individual beginning story.\nThe purpose of a memoir is to provide the visitor a complete photo of the person. It is essential to remember that background commonly remembers individuals for a solitary occasion or payment. In your memoir, you want to consist of everything from the earliest phases of your life, up until your existing age.\nYou can likewise compose your autobiography in numerous layouts. Some people pick to write in third person, while others like to write in initial individual. Whatever format you select, ensure that your text moves realistically.\nYou will require to research your topic to make sure that you consist of all the essential details. If you don’t have sufficient details, it is a good suggestion to take thorough notes, as this can aid you get the significance of your memoir.\nDocudrama\nPossibly the quickest kind of docudrama, biographical docudramas are a category of movie that generally takes the kind of a documentary and also reenacts the life of a celebrity. These films can be historic or social problem flicks. They can additionally be musicals or melodramas. These films tend to be based on books or on the life of a specific person.\nThe best biographical documentaries will certainly tell the tale of a celebrity or team of people as well as will offer the target market a good check out their individualities. They might be an allegory of power, an event of patriotism, or a tribute to ability. Sometimes, these docudramas can likewise be a testimony to economic success.\nOne of the most effective biographical docudramas are those that are based on study. They are generally backed up by journals, journals, paintings, and also created backgrounds of a duration. These records additionally draw on the technical sources of the workshop. They can use cinematography, lights, as well as editing and enhancing to develop a visual fallacy that makes it appear as if the actor as well as the topic are in actual time.\nIt is essential to keep in mind that biographical web content is not all that unusual in tv documentaries. The leading three biographical documentaries consist of a docudrama about Roger Ebert, a high cord legend, Philippe Petit, and Robert Evans, a Hollywood magnate.\nResources of details for a biography\nUsing biographical details can give an informative check out the life of a person. This info can provide details on a person’s background, achievements, as well as specialist credentials. In addition, biographical sources can cover groups of individuals, such as celebrities, musicians, as well as globe leaders.\nThere are numerous basic biographical resources readily available in print and on microfilm. Furthermore, many important biographical sources are available online. These include articles in regulars, biographical thesaurus, as well as indexes. aaron dungca needham senior analyst\nBiographical resources are also offered in the library brochure. These resources can be browsed by birth place, citizenship, or career.\nThe Biography Resource Facility (BRC) is a database that supplies biographical information regarding greater than 150,000 individuals. The BRC includes details on noteworthy individuals throughout the world, from antiquity to the present. Relying on your search, the details might consist of standard realities and also a biography, or it might cover historical importance, outstanding accomplishments, as well as other information.\n← Expanding Your Investments Is A Great Method To Make A Lot More. → Standard Concepts of Organization.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 67, "original_length": 6778, "language": "en", "language_score": 0.95, "perplexity": 308.0, "bucket": "head"}
{"url": "http://brooklynda.org/2015/09/10/brooklyn-man-who-stabbed-75-year-old-woman-and-left-her-for-dead-sentenced-to-75-years-in-prison/", "digest": "sha1:BQJHGI3OMTAQOU7CQTMBQKKSJA3P4RFI", "length": 2842, "nlines": 13, "source_domain": "brooklynda.org", "title": "Brooklyn Man Who Stabbed 75-Year-Old Woman and Left Her for Dead Sentenced to 75 Years in Prison – The Brooklyn District Attorney's Office", "raw_content": "Brooklyn Man Who Stabbed 75-Year-Old Woman and Left Her for Dead Sentenced to 75 Years in Prison\nBrooklyn Man Who Stabbed 75-Year-Old Woman and\nLeft Her for Dead Sentenced to 75 Years in Prison\nDefendant, a Friend of the Victim’s Grandson, Forced His Way into Apartment\nBrooklyn District Attorney Ken Thompson today announced that a Brownsville man has been sentenced to 75 years in prison following his conviction on second-degree attempted murder and other charges for stabbing an elderly woman repeatedly and leaving her seriously injured on her apartment floor.\nDistrict Attorney Thompson said, “This defendant savagely stabbed a defenseless 75-year-old woman all over her body, robbed her of what little money she had and then left her to die. He deserves every day of his 75-year prison sentence.”\nThe District Attorney said that the defendant, Shytuan Breazil, 23, of Bristol Street, in Brownsville, Brooklyn, was today sentenced to 75 years in prison by Brooklyn Supreme Court Justice Vincent M. Del Guidice. The defendant was convicted of second-degree attempted murder, first-degree burglary and first-degree robbery.\nThe District Attorney said that, according to trial testimony, on September 18, 2013, at about 2 p.m., the victim, Alvita Morales, 75, was in her apartment on Warren Street in the Warren Gardens/Wycoff Housing Development, when she heard a knock on the door and looked through the peephole. She saw the defendant, whom she recognized as a friend of her grandson, and opened the door to tell him her grandson was not staying with her. The defendant then placed his book bag on the floor and said he had something for her grandson. When the victim tried to shut the door, he shoved her to the floor and forced his way into the apartment.\nOnce inside the apartment, according to trial testimony, the defendant demanded money and the victim told him she had $40 in her purse. He then took a large knife from her kitchen and put it in his pocket. The victim began to scream and the defendant placed his hand over her mouth and proceeded to stab her repeatedly. He then rifled through her belongings, stopping to check on her before leaving the apartment. The victim testified that she played dead, but after he left the apartment she managed to drag herself out into the hallway. A neighbor called 911. The defendant was soon identified and arrested the next day.\nThe victim sustained 15 stab wounds throughout her body including one to her neck and chest, as well as a fractured orbital bone in her right eye and two fractured ribs.\nThe case was prosecuted by Assistant District Attorney Kori A. Medow, of the District Attorney’s Trial Bureau V, Orange Zone, under the supervision of Thomas C. Ridges, Chief.\nBrooklyn Man Convicted of New Year’s Day Shooting\nBrooklyn Contractor Sentenced for Stealing Employees’ Wages", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 93, "original_length": 4271, "language": "en", "language_score": 0.98, "perplexity": 195.7, "bucket": "head"}
{"url": "http://butthenwhat.com/2011/04/14/obamas-trigger-option/", "digest": "sha1:4ETLBEE4TS7HW7GNF3FED2XEJ7BCDPP3", "length": 5421, "nlines": 25, "source_domain": "butthenwhat.com", "title": "Obama’s Trigger Option | But Then What", "raw_content": "Obama’s Trigger Option\nPosted by Tom Lindmark on April 14th, 2011\nThere isn’t a better source for analysis of Washington economic policy than Keith Hennessey. His ability to go beyond the nuts and bolts of a particular proposal and identify the way it folds into the manner in which Washington does business as well as ferret out the hidden games and agendas is unmatched. That’s why you should read his latest post on the President’s new budget proposal.\nWhen you do take a look at it pay particular attention to the section the debt trigger that Mr. Obama is putting forth. This is the fail-safe device which will presumably save us when the parties are unable to come to any sort of agreement. I didn’t pay much attention to it during the speech but it popped up this morning in a post by Ezra Klein and I’m beginning to wonder if this isn’t a key goal. Here’s Klein on the trigger:\nWhether you assume we have till mid-May or early June, that’s not enough time for Republicans to rethink their position on taxes and nor for Democrats to come around to privatizing Medicare. So there’s going to have to be some placeholder attached to the debt ceiling vote. The ‘trigger’ attached to Obama’s budget is a likely candidate. If we’re not on a better fiscal path come 2014, it begins indiscriminately slicing away at a large swath of the federal budget and, importantly, at tax expenditures. So, in theory at least, it puts us on the path to deficit reduction without requiring us to make the hard decisions of deficit reduction right this minute. That’s probably the likeliest immediate outcome of all of these plans and proposals.\nGot that? No agreement on anyone’s plan by the time we get to the debt ceiling drop dead date so both sides agree to the trigger mechanism. Presumably we fight this through the election and barring some huge mandate for change one way or the other, go back to fighting about the same subject in 2013 and assuming no compromise rely on the trigger to do the dirty work.\nAs Hennessey points out, there is a rather large bias in the trigger:\nThe President’s proposal is similar to past triggers in that it exempts all discretionary spending, Social Security, and interest on the debt. While past triggers limited the amounts that Medicare and Medicaid could be cut, the President’s trigger appears to exempt them entirely. The White House fact sheet says the trigger “should not apply to Social Security, low-income programs, or Medicare benefits.” Elsewhere it says the trigger applies only to mandatory spending.\nAssuming that “low-income programs” includes Medicaid, this means the trigger appears to apply to at most about $300 B (if triggered this year) in “other mandatory” spending. Half of that would hit federal retiree payments, a quarter would hit veterans’ benefits (if not defined as “low income”), and the rest would hit smaller things like farm subsidies.\nIt therefore appears that the President’s trigger would exempt more than 90% of government spending from the automatic across-the-board cut.\nThe trigger would also raise taxes by implementing “across-the-board spending reductions … [in] spending through the tax code.” In other words, the trigger would somehow (how??) automatically reduce tax expenditures across-the-board (rather than raising rates, it appears). No past trigger has included a tax increase. This is new.\nThe fog lifts. The across-the-board trigger would apply to less than 10% of federal spending and would also raise taxes. And since it would apply only to itemized deductions, it’s only going to hit a portion of those paying income taxes, which is only a portion of all Americans.\nThe trigger is, in effect, a tax increase trigger on those who itemize deductions, with a little other mandatory spending thrown in for good measure.\nThe overwhelming impact of the trigger would be to raise taxes on those who itemize. A much smaller portion of triggered deficit reduction would come from automatic spending cuts.\nWhen you combine the automatic nature of this policy with the absence of specific policies needed to sufficiently reduce spending in the long run, the effect of this trigger would be to shift the burden of future entitlement spending increases away from deficits and onto higher income taxpayers. The future default would be that entitlement spending would grow at an unsustainable rate, and taxes on “the rich” would grow to hold deficits below 3% of GDP.\nHe notes correctly that structured as it appears to be, the trigger rewards those who favor increased spending financed by higher taxes to stonewall on budget cuts.\nKeep an eye on this particular feature of the President’s proposal. If it does end up as a compromise feature of a debt ceiling increase, you can expect the Democrats to go into full stall mode. Assuming the President is reelected, they can continue to fight any significant spending cuts, justifying their actions by pointing to the trigger as the mechanism which will mediate irreconcilable differences.\nApril 13, 2011 Obama Delivers A Political Speech Not A Plan (74)\nApril 10, 2013 Budget Battles (0)\nMarch 7, 2009 Is Obama A Radical? (0)\nApril 12, 2011 Will Obama Move To The Right On The Budget? (23)\nApril 12, 2011 A Progressive Deficit Reduction Plan (27)\nPosted in economy, politics Tags: obama budget, Trigger Option\n« Obama Delivers A Political Speech Not A Plan\nWhy Do These People Continue to Disemble? »", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 127, "original_length": 7002, "language": "en", "language_score": 0.94, "perplexity": 331.0, "bucket": "head"}
{"url": "http://cdnbookworm.blogspot.com/2019/10/slow-train-to-switzerland.html","digest": "sha1:HVHGJOC2OU3INMG3ARCATUEKS43S5HTE", "length": 3148, "nlines": 21, "source_domain": "cdnbookworm.blogspot.com", "title": "Canadian Bookworm: Slow Train to Switzerland", "raw_content": "Slow Train to Switzerland\nFinished September 28\nSlow Train to Switzerland: One Tour, Two Trips, 150 Years -- and a World of Change Apart by Diccon Bewes\nI liked the premise of this book, following in the footsteps of an earlier journey. Diccon Bewes is a British travel writer who lives in Switzerland, and during research he came across a diary from a young Englishwoman, Jemima Morrell, who, as part of a group who called themselves the Junior United Alpine Club, travelled on the very first Thomas Cook tour to Switzerland in 1863. The group consisted of four young women and three young men, and included Jemima's brother William, who paid for both of them.\nBewes determined to follow as much as possible in her footsteps, following the route she took, staying in the same places and visiting the same sights as much as possible. Near the beginning of the book is a map of the Cook tour from 1863 which took place from June 26th to July 15th, and included travel by rail, diligence, foot, mule, and steamship. With Thomas Cook the company that launched modern mass tourism, and by the time I finished the book going into bankruptcy, this book looks at travel from an interesting vantage point. Bewes took the trip with his mother, going back to certain points at a later date on his own.\nAppendices include: a brief description of the world in 1863, and a timeline of that year showing some important events that occured; a summary, including data points of Switzerland in the 1860s with information on language spoken, size of towns, birth and death rates, wages and prices, and occupations; and descriptions and explanations on money of the time, both English and Swiss their modern equivalencies.\nAs he followed Jemima's journey, he and his mother read sections from the diary at each point in their journey, and while many of the lodgings that she stayed in no longer existed, a few did. Some sections of the journey are now done by train, where there weren't trains back then, and Jemima's journey definitely involved longer and more difficult travel times. Some of her days were exceedingly long, and many of the places she stayed didn't offer the modern conveniences now available.\nDewes shows the differences between the two experiences plainly, from the modes of travel, to the the time travelling took, to the things one was able to see at each point in the journey. He shows the huge changes that have taken place in the tourism industry in Switzerland, and talks about the drivers of those changes. He discusses changes to the physical environment, from the buildings and food on offer to the shrinking of the snow caps and glaciers. He follows up at the end with a look at what became of Jemima after this journey and the discovery of a personal connection to her family.\nThis was a fascinating and educational read, and hugely entertaining.\nLabels: History, Journeys, Memoirs, Switzerland, Travel, Writers\nNutcracker Night\nTears of Salt\nTriceratops Stomp\nThe Castle in the Sea\nThe Corner That Held Them\nMy Drowning\nA Better Man\nMurder in Passy\nBody Bereft\nMrs. Saint and the Defectives\n13th Canadian Book Challenge October Roundup", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 301, "original_length": 32561, "language": "en", "language_score": 0.98, "perplexity": 258.6, "bucket": "head"}
{"url": "http://co2toch4.eu/", "digest": "sha1:A7ZZBRV6AZR44STP7OUNZERIJ4RVEBZX", "length": 1661, "nlines": 12, "source_domain": "co2toch4.eu", "title": "Home - LIFE CO2toCH4", "raw_content": "Demonstration of a mobile unit for hybrid energy storage based on CO2 capture and renewable energy sources LIFE CO2toCH4 Life Ref. No: LIFE20 CCM/GR/001642\nArea of implementation: Greece (all regions), Italy (all regions)\nDuration: 48 months (01/10/2021-30/09/2025)\nProject Budget: 3,888,985 Euro\nEC Funding: 2,138,941 Euro (55.00%) Learn More\nLIFE CO2toCH4\nAbout Our Aim\nLIFE CO2toCH4 aims at developing and demonstrating an innovative, integrated, and sustainable industrial process for simultaneous energy storage and CO2 capture and utilization (CCU). The ultimate goal of the project is to construct, test and operate (TRL8) a smart mobile unit for hybrid energy storage able to be installed in remote energy systems that commonly have low capacity (e.g., remote areas or islands that are not interconnected with the central energy grid). The technology relies on the fact that the RES (Renewable Energy Sources) will be used for water electrolysis, and subsequently the produced H2 will be biologically converted into methane (as a non-fossil biofuel) together with CO2 from exhaust gasses.\nThe project is co-funded by LIFE\nThe project is co-funded by LIFE, the EU’s financial instrument supporting environmental, nature conservation and climate action projects throughout the EU.\nThe project is co-funded by Green Fund\nOur Project is also part of the LIFE projects that are co-Funded by the Green Fund. The project team would like to thank the Green Fund for co-funding the NTUA activities. More specifically, according to the Decision Number 242.4/2022 of the Management Board of the Green Fund, the amount of 40,000 Euro was approved for the year 2022.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 76, "original_length": 3208, "language": "en", "language_score": 0.91, "perplexity": 244.5, "bucket": "head"}
{"url": "http://conectahistoria.blogspot.com/2022/07/novedad-bibliografica-immunization-and.html", "digest": "sha1:PZHLW43MZRZNLSS7SL2OR7XUKFCZQOHK", "length": 1398, "nlines": 8, "source_domain": "conectahistoria.blogspot.com", "title": "Novedad bibliográfica: Immunization and States The Politics of Making Vaccines", "raw_content": "Boletín de Hª de la Ciencia, la Medicina y la Tecnología. ISSN: 1576-4826\nNovedad bibliográfica: Immunization and States The Politics of Making Vaccines\nEdited By Stuart Blume & Baptiste Baylac-Paouly\nGlobally, there has been a move away from national public sector vaccine development over the past 30 years. Immunization and States: The Politics of Making Vaccines explores vaccine geopolitics, analyzing why, and how this move happened, before looking at the ramifications in the context of Covid-19.\nThis unique book uses eight country studies – looking at Croatia, India, Iran, the Netherlands, Romania, Serbia, Spain, and Sweden – to explore the role of public sector vaccine institutes, past and present. Raising questions about national sovereignty, the erosion of multilateralism, and geopolitics, it also contributes to debates around public interest and privatization in the health sector. An extended introduction sets the chapters in an international context, whilst the epilogue looks forward to the future of vaccine development and production.\nThis is an important book for students, scholars, and practitioners with an interest in vaccine development from a range of fields, including public health, medicine, science and technology studies, history of medicine, politics, international relations, and the sociology of health and illness.\n15/01/23 - 22/01/2312\n08/01/23 - 15/01/237", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 566, "original_length": 13557, "language": "en", "language_score": 0.84, "perplexity": 224.8, "bucket": "head"}
{"url": "http://connectwarri.com.ng/about-us/", "digest": "sha1:BKZ7QBN76EK3TBGJXIESAQFJ67C77HIB", "length": 284, "nlines": 2, "source_domain": "connectwarri.com.ng", "title": "About Us - Connect Warri", "raw_content": "Phibounds.com.ng is a professional website where we give visitors the best, most in-depth, and most self-explanatory information on technology, Marketing and Income Growth Tips.\nNevertheless, we have made it our mission to respond to any questions you may have about Blogging and SEO.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 38, "original_length": 915, "language": "en", "language_score": 0.93, "perplexity": 271.9, "bucket": "head"}
{"url": "http://continuum.sjmsom.in/Home/continuum-2018/finance-continuum", "digest": "sha1:MUXYK7SACS74AKJCDQP2AOI2FDRVVHRA", "length": 13518, "nlines": 57, "source_domain": "continuum.sjmsom.in", "title": "Finance Continuum - Continuum", "raw_content": "Continuum Home‎ > ‎Continuum 2018‎ > ‎\nFinance Continuum 2018 was organized on 4th August 2018 with a theme reflecting the paradigm shift in the Indian Financial Sector. The Continuum saw a series of lectures centered on the theme:\n“Disruptive Innovation, Transformation and Changing Regulations: Paradigm Shift in the Indian Financial Sector”\nFollowing luminaries participated for delivering lectures at Finance Continuum 2018 on August 4th, 2018 at SJMSOM, IIT Bombay:\nMs. Shalini Chhabra | Senior Vice President- HDFC Bank\nMr. Shivaji Dhekane | Deputy Vice President - Analytics, Tata Capital\nMr. Nayan Mehta | Chief Financial Officer, Bombay Stock Exchange\nMr. Ashish Desai | Senior Vice President and Head - Product and Payments, Aditya Birla Payments Bank\nMr. Nitish Sikand | Executive Vice President and Fund Manager – Fixed Income at Invesco Mutual Fund\nMr. Ashish Jain | Head of Fund Services–Deutsche Bank\nMr. Anil Ghelani | Head of Passive Investments & Products – DSP BlackRock\nMr. Yatish Shivaprasad | Senior Vice President- Societe Generale GSC\nMr. Amol Deherkar | Head of Corporate planning and strategy – Retail finance at Edelweiss\nListed below are some of the suggestive and non-restrictive sub-themes for discussion:\nThe outlook for the Indian Banking Sector\nSpeaker: Ms. Shalini Chhabra| Senior Vice President- HDFC Bank\nThe Indian banking system consists of 27 public sector banks, 22 private sector banks, 44 foreign banks, 56 regional rural banks, 1,589 urban cooperative banks and 93,550 rural cooperative banks, in addition to cooperative credit institutions. Bank credit grew at 12.64 percent year-on-year to Rs 85.511 lakh crore (US$ 1,326.78 billion) on May 11, 2018, from Rs. 75.91 lakh crore (US$ 1,131.47) on May 12, 2017.\nThe bank recapitalization plan by Government of India is expected to push credit growth in the country to 15 percent and as a result, help the GDP grow by 7 percent in FY19. Enhanced spending on infrastructure, speedy implementation of projects and continuation of reforms are expected to provide further impetus to growth. All these factors suggest that India’s banking sector is also poised for robust growth as the rapidly growing business would turn to banks for their credit needs.\nNBFC Regulations: Evolution, rationalization & challenges ahead\nSpeaker: Mr. Shivaji Dhekane | Deputy Vice President - Analytics, Tata Capital\nNon-banking finance companies (NBFCs) are companies engaged in the business of loans and advances that form an important and integral part of the Indian financial system. They play an important role in nation building and financial inclusion by complementing the commercial banking sector in making credit available to the unbanked segments of society, especially to the micro, small and medium enterprises (MSMEs), which account for the majority of non-agricultural employment in the country. In terms of financial assets, NBFCs have recorded a healthy growth of 19% CAGR over the past few years and its share in total credit is expected to grow to 20% by 2020 from 13% in 2015.\nWith the growing importance of data-driven decisions, technology can enable NBFCs to more efficiently serve their customers. Some of the applications include lending based on data from mobile phone records, the rise of social media scoring, assessing of the customer’s propensity to repay the loans. These are also referred to as alternative data scoring.\nNBFCs can realize the potential value of alternative data by making investments in technology and analytics to leverage both traditional and non-traditional data sources. This will enable a healthy competition, increase product innovation, and also further the government goal of increasing financial inclusion.\nChallenges still exist for NBFCs as the financial sector sees a rapid transformation. Owing to the lighter regulations on NBFCs, globally they have been seen to take up high leverage and sub-credit assets thus risking the health of their assets. Another issue is with respect to the convergence of the regulations of banks and NBFCs. Though it has improved in the recent iterations to regulations, further convergence is desired. The NBFCs act as a catalyst to the development of the country and is therefore important to nurture and actively manage their health.\nRedefining the lines: Growing influence of FinTechs on Indian Financial services and the challenges\nSpeaker: Mr. Nayan Mehta | Chief Financial Officer, Bombay Stock Exchange\nFintech refers to financial technology that describes an emerging financial services sector in the 21st century. Originally, the term applied to technology applied to the back-end of established consumer and trade financial institutions. Since the end of the first decade of the 21st century, the term has expanded to include any technological innovation in the financial sector, including innovations in financial literacy and education, retail banking, investment and even crypto-currencies like bitcoin.\nSince the internet revolution and the mobile internet revolution, however, financial technology has grown explosively, and fintech, which originally referred to computer technology applied to the back office of banks or trading firms, now describes a broad variety of technological interventions into personal and commercial finance. According to EY, Fintech Adoption Index, one-third of consumers utilize at least two or more fintech services and those consumers are also increasingly aware of fintech as a part of their daily lives.\nTrends in Digital Lending\nSpeaker: Mr. Ashish Desai| Senior Vice President and Head - Product and Payments, Aditya Birla Payments Bank\nDigital Lending enables borrowers to apply for any consumer or business lending product (credit card, line of credit, mortgage, business loan) 24x7 from any internet connected device, at any location, any time of the day. The aim is to make lending fully digital across channels and mobile devices.\nDigital lending targets to transform inefficient and lengthy loan and mortgage origination processes into a fully digital, paperless, risk-conscious and customer-oriented experience streamlining tasks and operations for realtors, partners, brokers, agents, branch employees, specialists and back office users across any type of device.\nThe Changes in the mutual fund industry, from a regulatory standpoint, in the recent past and its impact on the industry\nSpeaker: Mr. Nitish Sikand| Executive Vice President and Fund Manager – Fixed Income at Invesco Mutual Fund\nIn the aftermath of the 2007-08 financial crises, the regulations in the financial services industry have increased many folds. In India, SEBI has also introduced a couple of initiatives to protect the investor’s interest that on the other hands can be considered as anti-industry.\nEntry Load Ban: In August 2009, SEBI banned the charge of entry loads on investors thereby decreasing distributors margins.\nIntroduction of Uniform factsheets: In Sep 2015, SEBI directed mutual fund houses to standardize their fact sheets with the aim to prevent investors from taking unwarranted risks.\nColour coding to risk-o-meter: In 2013, SEBI made it mandatory for the mutual fund houses to use product labels with color codes to help investors assess the risk involved while investing in a respective mutual fund scheme.\nIntroduction of Direct Plans: The rationale behind introducing the direct plans was to reduce the role of distributors in increasing the retail participation. If investors approach mutual funds directly to transact, the fund houses would be able to cut off the long chain of distributors and agents who have always added to their cost structure.\nMandatory disclosure of commission (in the account statement) paid to distributors: As directed by SEBI, fund houses will now have to disclose the commissions they pay to distributors, in Rupee terms, for the businesses solicited.\nIndian Mutual Fund Industry: Challenging the status quo and setting the growth path\nSpeaker: Mr. Ashish Jain| Head of Fund Services–Deutsche Bank\nThe asset management industry has grown enormously in the last couple of decades with the AUM increasing 20 times from 47,000 crores in 1994 to 8.25 Lakh crores in 2014. At the same time, the industry expanded rapidly in terms of no. of companies, products, schemes. The industry is still very young and has huge opportunity to grow. But, despite this tremendous growth, the industry is still not able to free itself from the constraints and faces some challenges that needs to be discussed and tackled to create a path for growth for the industry for it to reach its true potential. The share of asset management industry has remained very low in the total household savings, garnering lesser than 3% from the total household savings. It is neither growing in a desirable pace. Even after being a consistent provider of inflation beating return, the industry is outpaced by other investment alternatives like Gold, Real Estate etc.\nThe asset management industry need to challenge its status quo and provide products for the needs of varied investors. This way the industry will be able to increase the volume and create greater return for all the stakeholders. It need to observe the global trends and take cue from them for providing wider product basket. If only these challenges are tackled, the industry will grow to its true potential.\nLatest trends in passive investments and overview on the debate about active v/s passive investments\nSpeaker: Mr. Anil Ghelani | Head of Passive Investments & Products – DSP BlackRock\nPassive investing has changed globally, driving costs down for mom-and-pop investors. However, mostly ETF (exchange-traded funds) is the passive investment strategy that is trending in the market and is one of the trusted investment vehicles for a broad range of institutional and individual investors. These came into the picture around 30 years ago, ETFs now manage roughly $4 trillion in assets globally which is less than the amount invested in open-end mutual funds (actively managed and indexed). Most market analysts expect assets in ETFs to outperform mutual funds within a few years, based on the current investing trend.\nPassive investing, sometimes called index investing, is a strategy that tries to replicate the returns from whatever index it tracks. That may be the FTSE 100 Index or something less well known. These days there are many passive funds and Exchange Traded Funds (ETFs) available to investors. Passive investments are popular with those who believe in active management to be unreliable and expensive. Instead, the passive investor is happy to accept market returns in exchange for the peace of mind that nobody is overcharging and returns are unlikely to seriously under perform the market.\nEven passive funds have some charges, so returns are virtually guaranteed to be a little lower than those of the index itself. Active investors are not prepared to accept average market returns and want to beat the market. They know they will have to pay higher fees to do so but this is balanced by the possibility of higher returns. There has long been a debate between supporters of active and passive investments as to which is better.\nTransformation Imperatives for a Global Bank\nSpeaker: Mr. Yatish Shivaprasad | Senior Vice President- Societe Generale GSC\nBanks are investing in the short-term on cloud computing and FinTech collaboration, and longer-term on blockchain and AI technologies, as part of a digitalisation drive. Digital disruption has the potential to shrink the role and relevance of today’s banks, and simultaneously help them create better, faster, cheaper services that make them an even more essential part of everyday life for institutions and individuals.\nWhen it comes to regulation, international standards are set by bodies such as the Basel Committee on Banking Supervision and the European Union. After the 2008 crisis, regulators had proposed significant solutions to the crash. Ten years after the global financial crisis, the banking industry has regained its health and the mood of bankers is more buoyant.\nIndian credit landscape and emerging trends in Retail Lending\nSpeaker: Mr. Amol Deherkar| Head of Corporate planning and strategy – Retail finance at Edelweiss\nRetail banking in India is not a new phenomenon. It has always been prevalent in India in various forms. For the last few years it has become synonymous with mainstream banking for many banks. The typical products offered in the Indian retail banking segment are housing loans, consumption loans for purchase of durables, auto loans, credit cards and educational loans. The loans are marketed under attractive brand names to differentiate the products offered by different banks. India’s retail banking now bigger than Russia but not close to China.\nThe growth of retail lending, especially, in emerging economies, is attributable to the rapid advances in information technology, the evolving macroeconomic environment, financial market reform, and several micro-level demand and supply side factors. Demand has grown for both corporate &amp; retail loans; particularly the services, real estate, consumer durables &amp; agriculture allied sectors have led the growth in credit. India registered a record inflow of amount of US$ 51.02 billion in mutual funds in FY 2016-17. According to the Association of Mutual Funds in India (AMFI) data, this was the highest investment in mutual fund schemes since the fiscal 1999-2000.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 166, "original_length": 15443, "language": "en", "language_score": 0.94, "perplexity": 328.4, "bucket": "head"}
{"url": "http://corneredtigers.net/index.php?chat/message/24857/quote", "digest": "sha1:MJ6XM7PD63PN5S4JI4CXXBNY3EUJTA6F", "length": 33, "nlines": 1, "source_domain": "corneredtigers.net", "title": "Cornered Tigers", "raw_content": "No one is chatting at the moment.", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 182, "original_length": 4595, "language": "en", "language_score": 0.95, "perplexity": 107.1, "bucket": "head"}
{"url": "http://dennisparlante.com/the-optimal-belarus-wives/","digest": "sha1:DGWKUANDGMJCO5FP2IM7ID757YEVBCS6", "length": 2938, "nlines": 10, "source_domain": "dennisparlante.com", "title": "The optimal Belarus Wives – Dennis Parlante", "raw_content": "The optimal Belarus Wives\nMany men want finding the ideal Belarus wives. But , how do you select the perfect woman by yourself? If you are a guy, the first thing to perform is to improve yourself. Most women in Belarus happen to be married when justin was 27, so it’s essential you get a good education to help you be highly regarded in the society. You can also find a very good job and dedicate a lot of time to your husband.\nIf you are looking for that wife by Belarus, you should think about this: You should be a gentleman and act accordingly. Women in Belarus are looking for men that will protect them and make them content. This means that you should trust her and do not step outside your limits. The first step towards obtaining your perfect diamond necklace is to get to know her better. Having a woman out of this country https://beautybride.org/belarus-brides/ can be complicated, but it will probably be worth it in the end.\nA typical Belarusian woman will probably be an economic spouse. They are not really interested in doing offers with your feelings, so they will never perform with them. They will care for their very own kids and provide monetary support for the relatives. You should also keep in mind that they are the very best mothers on your children. You may not have to worry about the near future if you choose a Belarusian partner. A Belarusian woman will aid you to manage all the things is obviously and help you build a steady family.\nA Belarusian woman is a classy and a well-educated woman who will be described as a great wife. She will be an excellent mother and stay at home mom. She will become your partner’s closest friend, and will not really tolerate your ego or your children moping. And she will value both you and your beliefs. So if you are looking for an ideal Weißrussland wife, select her. Therefore you won’t be sorry.\nA Belarus women’s character is a strong point of fascination. A good matrimony partner is actually a woman that’s empathetic and caring. Women from Belarus will make her husband content by centering on the important stuff in life, which includes family. Consequently, the ideal wife in a Belarusi person is a better half who has these types of qualities. This is because a woman via Belarus provides a positive and ambitious persona.\nA Belarus female is impartial and is very hard-working. She actually is a great mom and an excellent wife. The girl with a good fan base and https://originarios360.com/2019/12/21/internet-dating-questions/ shares household chores. Completely a good prepare food. She will prepare meals for her spouse and keep her family clean. She will as well take care of her husband’s healthiness. A woman via Belarus will be able to take care of her children but still be a fantastic better half.\nGetting Married in Japan\n7 factors internet dating is actually discouraging (Plus 7 tactics to change it out)\nThe Benefits of Online Dating For Women", "cc_segment": "crawl-data/CC-MAIN-2023-06/segments/1674764494826.88/wet/CC-MAIN-20230126210844-20230127000844-00000.warc.wet.gz", "original_nlines": 143, "original_length": 6290, "language": "en", "language_score": 0.97, "perplexity": 328.7, "bucket": "head"}
